
// Напишите программу, которая выводит текущую дату и время в формате "ГГГГ-ММ-ДД ЧЧ:ММ:СС".

DateTime date = DateTime.Now;
Console.WriteLine(date);