
//Напишите программ для Проверка, является ли список пустым. 

var listStr = new List<string>();

if(listStr.Count == 0)
{
    Console.WriteLine("Spisok  pust");
}
else
{
    Console.WriteLine("Spisok ne pust");
}