//Создайте программу C#, которая представляет следующую диаграмму классов UML. Диаграмма включает в себя публичные, частные,
//и защищенные атрибуты, а также зависимость и наследование классов.
//В диаграмме классов:

//-Класс Shape является базовым классом. У него есть частный атрибут «color» типа «string».
//— Класс Rectangle наследует от Shape и имеет дополнительные частные атрибуты length и width, оба типа int.
//- Класс Circle также наследует от Shape и имеет дополнительный частный атрибут Radius типа int.
//## Реализация на C#
//В этой реализации С#:
//— Класс Shape служит базовым классом. У него есть конструктор, который инициализирует атрибут color.
//- Класс Rectangle наследует от Shape и имеет собственный конструктор, который инициализирует атрибуты length и width.
//— Класс Circle также наследует от Shape и имеет собственный конструктор, инициализирующий атрибут Radius.


